/******************************************************************************/
/*
* File				: System.c
* Description		: Description
* Author			: Melgin
* Created on		: Date
*/
/******************************************************************************/
/******************************************************************************/
/*Files to Include                                                            */
/******************************************************************************/

//#if defined(__XC)
//    #include <xc.h>         /* XC8 General Include File */
//#elif defined(HI_TECH_C)
//    #include <htc.h>        /* HiTech General Include File */
//#endif
//
//#include <stdint.h>        /* For uint8_t definition */
//#include <stdbool.h>       /* For true/false definition */
#include <xc.h>         /* XC8 General Include File */
#include "System.h"
#include "M_Config.h"





/******************************************************************************/
/*
* FunctionName   : ConfigureOscillator()
* Description    : 时钟、中断、初始化
* EntryParameter : None
* ReturnValue    : None
*/
/******************************************************************************/
void ConfigureOscillator(void)
{
	IRCF2 =1;
	IRCF1 =1;
	IRCF0 =1;

	OSTS =0;
	HTS =1;
	LTS =1;
	SCS =1;

	init_timer0();
	init_timer1();
	init_timer2();
	init_INT0();

	TMR0IE=0;
	/******************************************************************************/
	/* PIE1：外设中断允许寄存器1
		bit 6 ADIE：A/D 转换器（ADC）中断允许位
			1 = 允许ADC 中断
			0 = 禁止ADC 中断
		bit 5 RCIE：EUSART 接收中断允许位
			1 = 允许EUSART 接收中断
			0 = 禁止EUSART 接收中断
		bit 4 TXIE：EUSART 发送中断允许位
			1 = 允许EUSART 发送中断
			0 = 禁止EUSART 发送中断
		bit 3 SSPIE：主同步串行端口（MSSP）中断允许位
			1 = 允许MSSP 中断
			0 = 禁止MSSP 中断
		bit 2 CCP1IE：CCP1 中断允许位
			1 = 允许CCP1 中断
			0 = 禁止CCP1 中断
		bit 1 TMR2IE：Timer2 与 PR2 匹配中断允许位
			1 = 允许TMR2 与PR2 匹配中断
			0 = 禁止TMR2 与PR2 匹配中断
		bit 0 TMR1IE：Timer1 溢出中断允许位
			1 = 允许Timer1 溢出中断
			0 = 禁止Timer1 溢出中断 */
	TMR1IE=1;
	TMR2IE=1;
//	ADIE =1;
	PEIE=1;
	/******************************************************************************/
	INTE =0;

	GIE=1;
}


/******************************************************************************/
/*
* FunctionName   : init_timer0()
* Description    : Description
* EntryParameter : None
* ReturnValue    : None
*/
/******************************************************************************/
void init_timer0(void)
{
	/******************************************************************************/
	/* 定时器初值*/
	TMR0 =C_TMR0_CNT;

	/******************************************************************************/
	/* T0CS： TMR0 时钟源选择位
		1 = T0CKI 引脚上的跳变沿
		0 = 内部指令周期时钟（FOSC/4） */
	T0CS =0;

	/******************************************************************************/
	/* TMR0 时钟源边沿选择位
		1 = 在T0CKI 引脚上电平发生由高到低的跳变时递增
		0 = 在T0CKI 引脚上电平发生由低到高的跳变时递增 */
	T0SE =0;

	/******************************************************************************/
	/* 预分频器分配
		1 = 预分频器分配给WDT
		0 = 预分频器分配给Timer0 模块*/
	PSA =1;
	/******************************************************************************/
	/* 预分频 */
		/* 	位值<2:0>	TMR0 分频比			WDT 分频比
			000			1 : 2				1 : 1
			001			1 : 4   			1 : 2
			010			1 : 8   			1 : 4
			011			1 : 16  			1 : 8
			100			1 : 32  			1 : 16
			101			1 : 64  			1 : 32
			110			1 : 128 			1 : 64
			111			1 : 256 			1 : 128 */
	PS2 =1;
    PS1 =1;
    PS0 =1;
	/******************************************************************************/
}


/******************************************************************************/
/*
* FunctionName   : init_timer1()
* Description    : Description
* EntryParameter : None
* ReturnValue    : None
*/
/******************************************************************************/
void init_timer1(void) /*init timer1*/
{
	TMR1H =C_TMR1H_CNT;		//定时器初值
	TMR1L =C_TMR1L_CNT;		//定时器初值
	/******************************************************************************/
	/* T1CKPS<1:0>：Timer1 输入时钟预分频比选择位
		11 = 1:8 预分频比
		10 = 1:4 预分频比
		01 = 1:2 预分频比
		00 = 1:1 预分频比*/
	T1CKPS1 =0;
	T1CKPS0 =0;
	/******************************************************************************/
	/* T1OSCEN：LP 振荡器使能控制位
		1 = 使能LP 振荡器作为Timer1 的时钟源
		0 = LP 振荡器关闭 */
	T1OSCEN =0;
	/******************************************************************************/
	/* T1SYNC：Timer1 外部时钟输入同步控制位
		TMR1CS = 1：
			1 = 不与外部时钟输入同步
			0 = 与外部时钟输入同步
		TMR1CS = 0：
		忽略此位。Timer1 使用内部时钟。 */
	T1SYNC =0;
	/******************************************************************************/
	/* TMR1CS：Timer1 时钟源选择位
		1 = 来自T1CKI 引脚的外部时钟源（上升沿触发）
		0 = 内部时钟源（FOSC/4） */
	TMR1CS =0;

	/******************************************************************************/
	/* TMR1ON：Timer1 使能位
		1 = 使能Timer1
		0 = 禁止Timer1 */
	TMR1ON =1;
/******************************************************************************/
}


/******************************************************************************/
/*
* FunctionName   : init_timer2()
* Description    : Description
* EntryParameter : None
* ReturnValue    : None
*/
/******************************************************************************/
void init_timer2(void)
{
	PR2 =C_PR2_CNT;
	/******************************************************************************/
	/*TOUTPS<3:0>：Timer2 输出后分频比选择位
			0000 = 1:1 后分频比
			0001 = 1:2 后分频比
			0010 = 1:3 后分频比
			0011 = 1:4 后分频比
			0100 = 1:5 后分频比
			0101 = 1:6 后分频比
			0110 = 1:7 后分频比
			0111 = 1:8 后分频比
			1000 = 1:9 后分频比
			1001 = 1:10 后分频比
			1010 = 1:11 后分频比
			1011 = 1:12 后分频比
			1100 = 1:13 后分频比
			1101 = 1:14 后分频比
			1110 = 1:15 后分频比
			1111 = 1:16 后分频比  */
	TOUTPS3 =1;
	TOUTPS2 =1;
	TOUTPS1 =1;
	TOUTPS0 =1;
	/******************************************************************************/
	/* TMR2ON：Timer2 使能位
			1 = 使能Timer2
			0 = 禁止Timer2 */
	TMR2ON =1;
	/******************************************************************************/
	/* T2CKPS<1:0>：Timer2 时钟预分频比选择位
			00 = 预分频值为1
			01 = 预分频值为4
			1x = 预分频值为16 */
	T2CKPS1 =0;
	T2CKPS0 =0;
}


void init_INT0(void)
{

	RBIF =0;
	/******************************************************************************/
	//	INTEDG: Interrupt Edge Select bit
		//		1 = Interrupt on rising edge of RB0/INT pin
		//		0 = Interrupt on falling edge of RB0/INT pin
	INTEDG =0;
}




